In [1]:
import pandas as pd
import matplotlib as plt

In [2]:
world = pd.read_csv('/Users/bobbiewilliams/Desktop/SQL And Phyton 2025 projects/Data for Phyton Course/2018-2019 Happiness.csv')
airbnb = pd.read_csv('/Users/bobbiewilliams/Desktop/SQL And Phyton 2025 projects/Data for Phyton Course/airbnb.csv')
salaries = pd.read_csv('/Users/bobbiewilliams/Desktop/SQL And Phyton 2025 projects/Data for Phyton Course/salaries.csv')
sales = pd.read_csv('/Users/bobbiewilliams/Desktop/SQL And Phyton 2025 projects/Data for Phyton Course/web_sales.csv')

In [4]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60398 entries, 0 to 60397
Data columns (total 11 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductKey             60398 non-null  int64
 1   product                60398 non-null  object
 2   product_subcategory    60398 non-null  object
 3   OrderDateKey           60398 non-null  int64
 4   CalendarYear           60398 non-null  int64
 5   SalesTerritoryRegion   60398 non-null  object
 6   SalesTerritoryCountry  60398 non-null  object
 7   SalesOrderNumber       60398 non-null  object
 8   SalesAmount            60398 non-null  float64
 9   TaxAmt                 60398 non-null  float64
 10  Freight                60398 non-null  float64
dtypes: float64(3), int64(3), object(5)
memory usage: 5.1+ MB

In [6]:
sales['SalesAmount']

0        3578.2700
1        3399.9900
2        3399.9900
3         699.0982
4        3399.9900
           ...
60393      21.9800
60394       8.9900
60395      21.9800
60396     159.0000
60397       8.9900
Name: SalesAmount, Length: 60398, dtype: float64

In [8]:
airbnb[['Property Type','Room Type' ]]

     Property Type        Room Type
0        Apartment  Entire home/apt
1        Apartment     Private room
2        Apartment     Private room
3        Apartment  Entire home/apt
4        Apartment     Private room
...            ...              ...
9769          Loft  Entire home/apt
9770     Apartment  Entire home/apt
9771     Apartment  Entire home/apt
9772     Apartment  Entire home/apt
9773     Apartment          Entire

[9774 rows x 2 columns]

In [13]:
salaries.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [15]:
salaries['salary_in_usd'].mean()

149488.26564452017

In [16]:
sales['SalesAmount'].sum()

29358677.220699996

In [17]:
sales.mean(numeric_only = True)

ProductKey      4.375579e+02
OrderDateKey    2.012973e+07
CalendarYear    2.012902e+03
SalesAmount     4.860869e+02
TaxAmt          3.888695e+01
Freight         1.215222e+01
dtype: float64

In [19]:
sales.columns

Index(['ProductKey', 'product', 'product_subcategory', 'OrderDateKey',
       'CalendarYear', 'SalesTerritoryRegion', 'SalesTerritoryCountry',
       'SalesOrderNumber', 'SalesAmount', 'TaxAmt', 'Freight'],
      dtype='object')

In [20]:
sales['SalesAmount'].std()

928.4898919809369

In [22]:
airbnb['Beds'].mean()

1.5472550025654181

In [23]:
sales.describe()

,ProductKey,OrderDateKey,CalendarYear,SalesAmount,TaxAmt,Freight
count,60398.000000,6.039800e+04,60398.000000,60398.000000,60398.000000,60398.000000
mean,437.557932,2.012973e+07,2012.902298,486.086911,38.886954,12.152217
std,118.088390,4.745050e+03,0.477666,928.489892,74.279193,23.212248
min,214.000000,2.010123e+07,2010.000000,2.290000,0.183200,0.057300
25%,359.000000,2.013040e+07,2013.000000,7.950000,0.636000,0.198800
50%,479.000000,2.013071e+07,2013.000000,29.990000,2.399200,0.749800
75%,529.000000,2.013102e+07,2013.000000,539.990000,43.199200,13.499800
max,606.000000,2.014013e+07,2014.000000,3578.270000,286.261600,89.456800

In [24]:
sales.columns

Index(['ProductKey', 'product', 'product_subcategory', 'OrderDateKey',
       'CalendarYear', 'SalesTerritoryRegion', 'SalesTerritoryCountry',
       'SalesOrderNumber', 'SalesAmount', 'TaxAmt', 'Freight'],
      dtype='object')

In [25]:
sales['product_subcategory'].value_counts(ascending = True)

product_subcategory
Bike Stands            249
Bike Racks             328
Vests                  562
Socks                  568
Hydration Packs        733
Cleaners               908
Shorts                1019
Gloves                1430
Fenders               2121
Touring Bikes         2167
Caps                  2190
Jerseys               3332
Mountain Bikes        4970
Helmets               6440
Bottles and Cages     7981
Road Bikes            8068
Tires and Tubes      17332
Name: count, dtype: int64

In [27]:
airbnb['Property Type'].value_counts()

Property Type
Apartment          8653
House               652
Loft                327
Bed & Breakfast      50
Townhouse            32
Condominium          22
Dorm                 13
Other                 8
Camper/RV             6
Boat                  3
Bungalow              3
Cabin                 2
Villa                 1
Name: count, dtype: int64

In [33]:
salaries[['job_title','salary_in_usd']].value_counts()

job_title                        salary_in_usd
Data Engineer                    160000           68
                                 130000           63
Applied Scientist                136000           54
Data Analyst                     100000           50
Data Scientist                   160000           48
                                                  ..
Data Engineer                    172500            1
                                 172600            1
                                 172800            1
                                 172900            1
Staff Machine Learning Engineer  185000            1
Name: count, Length: 3600, dtype: int64